[{
    "id": 1,
    "dates": "2020-05-11T20:15:00-04:00",
    "title": "7 Best Fonts for YouTube Thumbnails That Look Sleek and Modern",
    "slug": "youtube-thumbnails",
    "summary": "YouTube content creators are very sure about that things that would bring them viewers for their content and that is non other than the captivating thumbnail.",
    "h2_a": "Why Invest Time into Thumbnails?",
    "h2_b":"10 Best fonts for YouTube Thumbnails",
    "h2_c":"1. Evogria",
    "h2_d":"2. League spartarn",
    "h2_e":"3. Lolita one ",
    "h2_f":"4. Jumbo",
    "h2_g":"5. Aero font",
    "h2_h":"6. Questrian ",
    "h2_i":"7. Chinese Rock",
    "h2_j":"8. Robot Crush",
    "h2_k":"9. Agency FB",
    "h2_l":"10. Montserrat Extra Bold",
    "h2_m":"Bonus",
    "article_a": "Other details go into the success of a video like tags and driving traffic to the video by sharing over social media but 9 times out of 10, an eye catching thumbnail would move someone to click on the thumbnail just to ease their excitement. With all these things put in mind, the success of a video begins with the thumbnail.",
    "article_b": "A well designed YouTube thumbnail with the perfect font can drive more clicks and views to your channel and videos and you don&#39;t have to take our word for it; according to the YouTube Creator Academy, 90% of the videos that perform best on YouTube use a custom thumbnail. Yes, an engaging thumbnail is tempting to click on than that when the audience can&#39;t get a sneak peak of what exactly might happen in the video. Statistics show that, there are more than 500 hours of video being uploaded on YouTube every minute, so there&#39;s lots of competition if you lack some creativity.We found out some of the best fonts that will make your custom thumbnail pop and help to drive more traffic you way. These are some of the best fonts for YouTube out there.",
    "article_c": "Evogria font is perfect for Posters, Displays and Magazines. With color added to it (i.e. Orange), the font is so captivating which makes it a must have for YouTube thumbnails.",
    "article_d": "League spartarn has a classic and modern feel to it. A strong weight, beautiful and historical touch. This font has no problem kicking its enemies in the chest. A must have for YouTube thumbnails",
    "article_e": "Lolita one is a display typeface with a fat look, ideal for headlines and short texts. With a slightly condensed structure and some eye-catching details, it adds personal and soft looks to any page. Something about the font that screams &quot;lovely&quot;. Viewers would immediately want to feed off such love if used on your YouTube Thumbnail.",
    "article_f": "Jumbo is our favorite font hands down. Jumbo is a techno, various font designed by dustBUST. It's free for personal use and very beautifully crafted. The words have a nice 'O' appearance curved to them making it a sleek font to have for your YouTube thumbnail",
    "article_g": "Aero font reminds me of the sodoku  puzzle game, the logic based game. It stands out and channel and fit for channels about computers, sports especially athletics. It is a nice font to have for your YouTube thumbnail.",
    "article_h": "Questrian font looks like a wood curved word. Nice for Magazines. You can add a little nice background to it and you're ready to go!",
    "article_i": "Chinese Rock mething simple hearted. This font catches a child's innocence. Nice for kids channels and calmly topics. ",
    "article_j" :"Robot CrushVery thick and precise. This font has a robotic feel to it which would be perfect for game channels. For dance channels, try it out if you're doing a robotic dance.",
    "article_k" :"Agency FB is a sleek font. It has Long narrow lettering like aerial narrow from back in the day (if you know what I mean). A very nice font for mechanical channels.",
     "article_l" :"Montserrat Extra Bold Very bold and condensed at the same time to usher in viewers because of the captivating look",
    "article_m" :"Impact (Our go to font for headings in Microsoft Word)",
    "article_n" :"Robot Condensed (This font is used by Google and you can tell it's nice on the eyes)",
    "author": "Nangoli Jude Eric",
    "dateAs": "",
    "links_a": "https://www.dafont.com/evogria.font",
    "link_b": "https://www.fontsquirrel.com/fonts/league-spartan",
    "link_c": "https://www.fontsquirrel.com/fonts/lolita",
    "links_d": "",
    "link_e": "",
    "link_f": " ",
    "links_g": "",
    "link_h": "",
    "link_i": " ",
    "links_j": "",
    "link_k": "",
    "link_l": " ",
    "links_m": "",
    "link_n": "",
    "link_o": " ",
    "image_a": "https://images.unsplash.com/photo-1574237443896-e5f957f21dda?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=750&q=80"
  }
  ]